// ntos.h: interface for the ntos class.
//
//////////////////////////////////////////////////////////////////////



#if !defined(AFX_NTOS_H__6A0074D1_8BF0_4D6C_88FB_5FCB4F06B186__INCLUDED_)
#define AFX_NTOS_H__6A0074D1_8BF0_4D6C_88FB_5FCB4F06B186__INCLUDED_

#ifndef IN
#define IN
#define OUT
#endif

#ifdef FASTCALL
#undef FASTCALL
#endif

#ifndef FASTCALL
#define FASTCALL _fastcall
#endif


#pragma warning(disable: 4013)
//
// Process flags. Use interlocked operations with PS_SET_BITS, etc
// to modify these.
//

#include "ntdbg.h"



typedef ULONG WIN32_PROTECTION_MASK;
typedef PULONG PWIN32_PROTECTION_MASK;

#define MM_ZERO_ACCESS         0  // this value is not used.
#define MM_READONLY            1
#define MM_EXECUTE             2
#define MM_EXECUTE_READ        3
#define MM_READWRITE           4  // bit 2 is set if this is writable.
#define MM_WRITECOPY           5
#define MM_EXECUTE_READWRITE   6
#define MM_EXECUTE_WRITECOPY   7

#define MM_NOCACHE            0x8
#define MM_GUARD_PAGE         0x10
#define MM_DECOMMIT           0x10   // NO_ACCESS, Guard page
#define MM_NOACCESS           0x18   // NO_ACCESS, Guard_page, nocache.
#define MM_UNKNOWN_PROTECTION 0x100  // bigger than 5 bits!

#define MM_INVALID_PROTECTION ((ULONG)-1)  // bigger than 5 bits!

#define MM_PROTECTION_WRITE_MASK     4
#define MM_PROTECTION_COPY_MASK      1
#define MM_PROTECTION_OPERATION_MASK 7 // mask off guard page and nocache.

#define PS_PROCESS_FLAGS_HAS_ADDRESS_SPACE      0x00040000UL // This process has an address space
#define PS_PROCESS_FLAGS_LAUNCH_PREFETCHED      0x00080000UL // Process launch was prefetched
#define PS_PROCESS_INJECT_INPAGE_ERRORS         0x00100000UL // Process should be given inpage errors - hardcoded in trap.asm too
#define PS_PROCESS_FLAGS_VM_TOP_DOWN            0x00200000UL // Process memory allocations default to top-down
#define PS_PROCESS_FLAGS_IMAGE_NOTIFY_DONE      0x00400000UL // We have sent a message for this image
#define PS_PROCESS_FLAGS_PDE_UPDATE_NEEDED      0x00800000UL // The system PDEs need updating for this process (NT32 only)
#define PS_PROCESS_FLAGS_VDM_ALLOWED            0x01000000UL // Process allowed to invoke NTVDM support
#define PS_PROCESS_FLAGS_SMAP_ALLOWED           0x02000000UL // Process allowed to invoke SMAP support
#define PS_PROCESS_FLAGS_CREATE_FAILED          0x04000000UL // Process create failed

#define PS_PROCESS_FLAGS_DEFAULT_IO_PRIORITY    0x38000000UL // The default I/O priority for created threads. (3 bits)

#define PS_PROCESS_FLAGS_PRIORITY_SHIFT         27

#define PS_PROCESS_FLAGS_EXECUTE_SPARE1         0x40000000UL //
#define PS_PROCESS_FLAGS_EXECUTE_SPARE2         0x80000000UL //

//
// Debugger isn't shown this thread
//

#define PS_CROSS_THREAD_FLAGS_HIDEFROMDBG          0x00000004UL


//
// This thread should skip sending its create thread message
//
#define PS_CROSS_THREAD_FLAGS_SKIP_CREATION_MSG    0x00000080UL

//
// This thread should skip sending its final thread termination message
//
#define PS_CROSS_THREAD_FLAGS_SKIP_TERMINATION_MSG 0x00000100UL
#define PS_CROSS_THREAD_FLAGS_DEADTHREAD           0x00000002UL

#define POOL_QUOTA_FAIL_INSTEAD_OF_RAISE 8
#define POOL_RAISE_IF_ALLOCATION_FAILURE 16               // ntifs
#define POOL_MM_ALLOCATION 0x80000000     // Note this cannot encode into the header.



//
// i386 Feature bit definitions
//
// N.B. The no execute feature flags must be identical on all platforms.

#define KF_V86_VIS          0x00000001
#define KF_RDTSC            0x00000002
#define KF_CR4              0x00000004
#define KF_CMOV             0x00000008
#define KF_GLOBAL_PAGE      0x00000010
#define KF_LARGE_PAGE       0x00000020
#define KF_MTRR             0x00000040
#define KF_CMPXCHG8B        0x00000080
#define KF_MMX              0x00000100
#define KF_WORKING_PTE      0x00000200
#define KF_PAT              0x00000400
#define KF_FXSR             0x00000800
#define KF_FAST_SYSCALL     0x00001000
#define KF_XMMI             0x00002000
#define KF_3DNOW            0x00004000
#define KF_AMDK6MTRR        0x00008000
#define KF_XMMI64           0x00010000
#define KF_DTS              0x00020000
#define KF_NOEXECUTE        0x20000000
#define KF_GLOBAL_32BIT_EXECUTE 0x40000000
#define KF_GLOBAL_32BIT_NOEXECUTE 0x80000000

#define try _try
#define except _except





// begin_ntsrv


// end_ntsrv
#define DBGKD_MAXSTREAM 16

// typedef struct _DBGKD_CONTROL_REPORT {
//     ULONG   Dr6;
//     ULONG   Dr7;
//     USHORT  InstructionCount;
//     USHORT  ReportFlags;
//     UCHAR   InstructionStream[DBGKD_MAXSTREAM];
//     USHORT  SegCs;
//     USHORT  SegDs;
//     USHORT  SegEs;
//     USHORT  SegFs;
//     ULONG   EFlags;
// } DBGKD_CONTROL_REPORT, *PDBGKD_CONTROL_REPORT;


#define REPORT_INCLUDES_SEGS    0x0001  // this is for backward compatibility

//
// DBGKD_CONTROL_SET
//
// This structure control value the debugger wants to set on every
// continue, and thus sets here to avoid packet traffic.
//

// typedef struct _DBGKD_CONTROL_SET {
//     ULONG   TraceFlag;                  // WARNING: This must NOT be a BOOLEAN,
// 	//     or host and target will end
// 	//     up with different alignments!
//     ULONG   Dr7;
//     ULONG   CurrentSymbolStart;         // Range in which to trace locally
//     ULONG   CurrentSymbolEnd;
// } DBGKD_CONTROL_SET, *PDBGKD_CONTROL_SET;

// begin_windbgkd


#define KI_EXCEPTION_INTERNAL               0x10000000
#define KI_EXCEPTION_GP_FAULT               (KI_EXCEPTION_INTERNAL | 0x1)
#define KI_EXCEPTION_INVALID_OP             (KI_EXCEPTION_INTERNAL | 0x2)
#define KI_EXCEPTION_INTEGER_DIVIDE_BY_ZERO (KI_EXCEPTION_INTERNAL | 0x3)
#define KI_EXCEPTION_ACCESS_VIOLATION       (KI_EXCEPTION_INTERNAL | 0x4)

#define EFLAGS_CF_MASK        0x00000001L
#define EFLAGS_PF_MASK        0x00000004L
#define EFLAGS_AF_MASK        0x00000010L
#define EFLAGS_ZF_MASK        0x00000040L
#define EFLAGS_SF_MASK        0x00000080L
#define EFLAGS_TF             0x00000100L
#define EFLAGS_INTERRUPT_MASK 0x00000200L
#define EFLAGS_DF_MASK        0x00000400L
#define EFLAGS_OF_MASK        0x00000800L
#define EFLAGS_IOPL_MASK      0x00003000L
#define EFLAGS_NT             0x00004000L
#define EFLAGS_RF             0x00010000L
#define EFLAGS_V86_MASK       0x00020000L
#define EFLAGS_ALIGN_CHECK    0x00040000L
#define EFLAGS_VIF            0x00080000L
#define EFLAGS_VIP            0x00100000L
#define EFLAGS_ID_MASK        0x00200000L

#define EFLAGS_USER_SANITIZE  0x003f4dd7L


#define RPL_MASK                                0x0003
#define MODE_MASK                               0x0001
#define KGDT_R0_CODE                            0x8
#define KGDT_R0_DATA                            0x10
#define KGDT_R3_CODE                            0x18
#define KGDT_R3_DATA                            0x20
#define KGDT_TSS                                0x28
#define KGDT_R0_PCR                             0x30
#define KGDT_R3_TEB                             0x38
#define KGDT_LDT                                0x48
#define KGDT_DF_TSS                             0x50
#define KGDT_NMI_TSS                            0x58


typedef struct _DESCRIPTOR // 3 elements, 0x8 bytes (sizeof) 
{                                                            
	/*0x000*/     UINT16       Pad;                                        
	/*0x002*/     UINT16       Limit;                                      
	/*0x004*/     ULONG32      Base;                                       
          }DESCRIPTOR, *PDESCRIPTOR;        

typedef struct _KSPECIAL_REGISTERS // 15 elements, 0x54 bytes (sizeof) 
{                                                                      
	/*0x000*/     ULONG32      Cr0;                                                  
	/*0x004*/     ULONG32      Cr2;                                                  
	/*0x008*/     ULONG32      Cr3;                                                  
	/*0x00C*/     ULONG32      Cr4;                                                  
	/*0x010*/     ULONG32      KernelDr0;                                            
	/*0x014*/     ULONG32      KernelDr1;                                            
	/*0x018*/     ULONG32      KernelDr2;                                            
	/*0x01C*/     ULONG32      KernelDr3;                                            
	/*0x020*/     ULONG32      KernelDr6;                                            
	/*0x024*/     ULONG32      KernelDr7;                                            
	/*0x028*/     struct _DESCRIPTOR Gdtr;       // 3 elements, 0x8 bytes (sizeof)   
	/*0x030*/     struct _DESCRIPTOR Idtr;       // 3 elements, 0x8 bytes (sizeof)   
	/*0x038*/     UINT16       Tr;                                                   
	/*0x03A*/     UINT16       Ldtr;                                                 
	/*0x03C*/     ULONG32      Reserved[6];                                          
          }KSPECIAL_REGISTERS, *PKSPECIAL_REGISTERS;                              

typedef struct _KPROCESSOR_STATE                 // 2 elements, 0x320 bytes (sizeof)  
{                                                                                     
	/*0x000*/     struct _CONTEXT ContextFrame;                // 25 elements, 0x2CC bytes (sizeof) 
	/*0x2CC*/     struct _KSPECIAL_REGISTERS SpecialRegisters; // 15 elements, 0x54 bytes (sizeof)  
          }KPROCESSOR_STATE, *PKPROCESSOR_STATE;       


typedef struct _PP_LOOKASIDE_LIST // 2 elements, 0x8 bytes (sizeof) 
{                                                                   
	/*0x000*/     struct _GENERAL_LOOKASIDE* P;                                   
	/*0x004*/     struct _GENERAL_LOOKASIDE* L;                                   
          }PP_LOOKASIDE_LIST, *PPP_LOOKASIDE_LIST;    


typedef struct _FNSAVE_FORMAT      // 8 elements, 0x6C bytes (sizeof) 
{                                                                     
	/*0x000*/     ULONG32      ControlWord;                                         
	/*0x004*/     ULONG32      StatusWord;                                          
	/*0x008*/     ULONG32      TagWord;                                             
	/*0x00C*/     ULONG32      ErrorOffset;                                         
	/*0x010*/     ULONG32      ErrorSelector;                                       
	/*0x014*/     ULONG32      DataOffset;                                          
	/*0x018*/     ULONG32      DataSelector;                                        
	/*0x01C*/     UINT8        RegisterArea[80];                                    
          }FNSAVE_FORMAT, *PFNSAVE_FORMAT;   

typedef struct _FXSAVE_FORMAT       // 14 elements, 0x208 bytes (sizeof) 
{                                                                        
	/*0x000*/     UINT16       ControlWord;                                            
	/*0x002*/     UINT16       StatusWord;                                             
	/*0x004*/     UINT16       TagWord;                                                
	/*0x006*/     UINT16       ErrorOpcode;                                            
	/*0x008*/     ULONG32      ErrorOffset;                                            
	/*0x00C*/     ULONG32      ErrorSelector;                                          
	/*0x010*/     ULONG32      DataOffset;                                             
	/*0x014*/     ULONG32      DataSelector;                                           
	/*0x018*/     ULONG32      MXCsr;                                                  
	/*0x01C*/     ULONG32      MXCsrMask;                                              
	/*0x020*/     UINT8        RegisterArea[128];                                      
	/*0x0A0*/     UINT8        Reserved3[128];                                         
	/*0x120*/     UINT8        Reserved4[224];                                         
	/*0x200*/     UINT8        Align16Byte[8];                                         
          }FXSAVE_FORMAT, *PFXSAVE_FORMAT;             

typedef struct _FX_SAVE_AREA          // 3 elements, 0x210 bytes (sizeof)  
{                                                                          
	union                             // 2 elements, 0x208 bytes (sizeof)  
	{                                                                      
		/*0x000*/         struct _FNSAVE_FORMAT FnArea; // 8 elements, 0x6C bytes (sizeof)   
		/*0x000*/         struct _FXSAVE_FORMAT FxArea; // 14 elements, 0x208 bytes (sizeof) 
	}U;                                                                    
	/*0x208*/     ULONG32      NpxSavedCpu;                                              
	/*0x20C*/     ULONG32      Cr0NpxState;                                              
          }FX_SAVE_AREA, *PFX_SAVE_AREA; 


typedef struct _PROCESSOR_IDLE_TIMES     // 3 elements, 0x20 bytes (sizeof) 
{                                                                           
	/*0x000*/     UINT64       StartTime;                                                 
	/*0x008*/     UINT64       EndTime;                                                   
	/*0x010*/     ULONG32      IdleHandlerReserved[4];                                    
          }PROCESSOR_IDLE_TIMES, *PPROCESSOR_IDLE_TIMES;         

typedef struct _PROCESSOR_POWER_STATE          // 45 elements, 0x120 bytes (sizeof) 
{                                                                                   
	/*0x000*/     PVOID IdleFunction;                                                  
	/*0x004*/     ULONG32      Idle0KernelTimeLimit;                                              
	/*0x008*/     ULONG32      Idle0LastTime;                                                     
	/*0x00C*/     VOID*        IdleHandlers;                                                      
	/*0x010*/     VOID*        IdleState;                                                         
	/*0x014*/     ULONG32      IdleHandlersCount;                                                 
	/*0x018*/     UINT64       LastCheck;                                                         
	/*0x020*/     struct _PROCESSOR_IDLE_TIMES IdleTimes;    // 3 elements, 0x20 bytes (sizeof)   
	/*0x040*/     ULONG32      IdleTime1;                                                         
	/*0x044*/     ULONG32      PromotionCheck;                                                    
	/*0x048*/     ULONG32      IdleTime2;                                                         
	/*0x04C*/     UINT8        CurrentThrottle;                                                   
	/*0x04D*/     UINT8        ThermalThrottleLimit;                                              
	/*0x04E*/     UINT8        CurrentThrottleIndex;                                              
	/*0x04F*/     UINT8        ThermalThrottleIndex;                                              
	/*0x050*/     ULONG32      LastKernelUserTime;                                                
	/*0x054*/     ULONG32      LastIdleThreadKernelTime;                                          
	/*0x058*/     ULONG32      PackageIdleStartTime;                                              
	/*0x05C*/     ULONG32      PackageIdleTime;                                                   
	/*0x060*/     ULONG32      DebugCount;                                                        
	/*0x064*/     ULONG32      LastSysTime;                                                       
	/*0x068*/     UINT64       TotalIdleStateTime[3];                                             
	/*0x080*/     ULONG32      TotalIdleTransitions[3];                                           
	/*0x08C*/     UINT8        _PADDING0_[0x4];                                                   
	/*0x090*/     UINT64       PreviousC3StateTime;                                               
	/*0x098*/     UINT8        KneeThrottleIndex;                                                 
	/*0x099*/     UINT8        ThrottleLimitIndex;                                                
	/*0x09A*/     UINT8        PerfStatesCount;                                                   
	/*0x09B*/     UINT8        ProcessorMinThrottle;                                              
	/*0x09C*/     UINT8        ProcessorMaxThrottle;                                              
	/*0x09D*/     UINT8        EnableIdleAccounting;                                              
	/*0x09E*/     UINT8        LastC3Percentage;                                                  
	/*0x09F*/     UINT8        LastAdjustedBusyPercentage;                                        
	/*0x0A0*/     ULONG32      PromotionCount;                                                    
	/*0x0A4*/     ULONG32      DemotionCount;                                                     
	/*0x0A8*/     ULONG32      ErrorCount;                                                        
	/*0x0AC*/     ULONG32      RetryCount;                                                        
	/*0x0B0*/     ULONG32      Flags;                                                             
	/*0x0B4*/     UINT8        _PADDING1_[0x4];                                                   
	/*0x0B8*/     union _LARGE_INTEGER PerfCounterFrequency; // 4 elements, 0x8 bytes (sizeof)    
	/*0x0C0*/     ULONG32      PerfTickCount;                                                     
	/*0x0C4*/     UINT8        _PADDING2_[0x4];                                                   
	/*0x0C8*/     struct _KTIMER PerfTimer;                  // 5 elements, 0x28 bytes (sizeof)   
	/*0x0F0*/     struct _KDPC PerfDpc;                      // 9 elements, 0x20 bytes (sizeof)   
	/*0x110*/     PVOID PerfStates;                                       
	/*0x114*/     PVOID PerfSetThrottle;                                               
	/*0x118*/     ULONG32      LastC3KernelUserTime;                                              
	/*0x11C*/     ULONG32      LastPackageIdleTime;                                               
          }PROCESSOR_POWER_STATE, *PPROCESSOR_POWER_STATE;                 
// 
typedef struct _KPRCB                                    // 91 elements, 0xC50 bytes (sizeof) 
{                                                                                             
	/*0x000*/     UINT16       MinorVersion;                                                                
	/*0x002*/     UINT16       MajorVersion;                                                                
	/*0x004*/     struct _KTHREAD* CurrentThread;                                                           
	/*0x008*/     struct _KTHREAD* NextThread;                                                              
	/*0x00C*/     struct _KTHREAD* IdleThread;                                                              
	/*0x010*/     CHAR         Number;                                                                      
	/*0x011*/     CHAR         Reserved;                                                                    
	/*0x012*/     UINT16       BuildType;                                                                   
	/*0x014*/     ULONG32      SetMember;                                                                   
	/*0x018*/     CHAR         CpuType;                                                                     
	/*0x019*/     CHAR         CpuID;                                                                       
	/*0x01A*/     UINT16       CpuStep;                                                                     
	/*0x01C*/     struct _KPROCESSOR_STATE ProcessorState;             // 2 elements, 0x320 bytes (sizeof)  
	/*0x33C*/     ULONG32      KernelReserved[16];                                                          
	/*0x37C*/     ULONG32      HalReserved[16];                                                             
	/*0x3BC*/     UINT8        PrcbPad0[92];                                                                
	/*0x418*/     struct _KSPIN_LOCK_QUEUE LockQueue[16];                                                   
	/*0x498*/     UINT8        PrcbPad1[8];                                                                 
	/*0x4A0*/     struct _KTHREAD* NpxThread;                                                               
	/*0x4A4*/     ULONG32      InterruptCount;                                                              
	/*0x4A8*/     ULONG32      KernelTime;                                                                  
	/*0x4AC*/     ULONG32      UserTime;                                                                    
	/*0x4B0*/     ULONG32      DpcTime;                                                                     
	/*0x4B4*/     ULONG32      DebugDpcTime;                                                                
	/*0x4B8*/     ULONG32      InterruptTime;                                                               
	/*0x4BC*/     ULONG32      AdjustDpcThreshold;                                                          
	/*0x4C0*/     ULONG32      PageColor;                                                                   
	/*0x4C4*/     ULONG32      SkipTick;                                                                    
	/*0x4C8*/     UINT8        MultiThreadSetBusy;                                                          
	/*0x4C9*/     UINT8        Spare2[3];                                                                   
	/*0x4CC*/     PVOID ParentNode;                                                                
	/*0x4D0*/     ULONG32      MultiThreadProcessorSet;                                                     
	/*0x4D4*/     struct _KPRCB* MultiThreadSetMaster;                                                      
	/*0x4D8*/     ULONG32      ThreadStartCount[2];                                                         
	/*0x4E0*/     ULONG32      CcFastReadNoWait;                                                            
	/*0x4E4*/     ULONG32      CcFastReadWait;                                                              
	/*0x4E8*/     ULONG32      CcFastReadNotPossible;                                                       
	/*0x4EC*/     ULONG32      CcCopyReadNoWait;                                                            
	/*0x4F0*/     ULONG32      CcCopyReadWait;                                                              
	/*0x4F4*/     ULONG32      CcCopyReadNoWaitMiss;                                                        
	/*0x4F8*/     ULONG32      KeAlignmentFixupCount;                                                       
	/*0x4FC*/     ULONG32      KeContextSwitches;                                                           
	/*0x500*/     ULONG32      KeDcacheFlushCount;                                                          
	/*0x504*/     ULONG32      KeExceptionDispatchCount;                                                    
	/*0x508*/     ULONG32      KeFirstLevelTbFills;                                                         
	/*0x50C*/     ULONG32      KeFloatingEmulationCount;                                                    
	/*0x510*/     ULONG32      KeIcacheFlushCount;                                                          
	/*0x514*/     ULONG32      KeSecondLevelTbFills;                                                        
	/*0x518*/     ULONG32      KeSystemCalls;                                                               
	/*0x51C*/     ULONG32      SpareCounter0[1];                                                            
	/*0x520*/     struct _PP_LOOKASIDE_LIST PPLookasideList[16];                                            
	/*0x5A0*/     struct _PP_LOOKASIDE_LIST PPNPagedLookasideList[32];                                      
	/*0x6A0*/     struct _PP_LOOKASIDE_LIST PPPagedLookasideList[32];                                       
	/*0x7A0*/     ULONG32      PacketBarrier;                                                               
	/*0x7A4*/     ULONG32      ReverseStall;                                                                
	/*0x7A8*/     VOID*        IpiFrame;                                                                    
	/*0x7AC*/     UINT8        PrcbPad2[52];                                                                
	/*0x7E0*/     VOID*        CurrentPacket[3];                                                            
	/*0x7EC*/     ULONG32      TargetSet;                                                                   
	/*0x7F0*/     PVOID WorkerRoutine;                                                           
	/*0x7F4*/     ULONG32      IpiFrozen;                                                                   
	/*0x7F8*/     UINT8        PrcbPad3[40];                                                                
	/*0x820*/     ULONG32      RequestSummary;                                                              
	/*0x824*/     struct _KPRCB* SignalDone;                                                                
	/*0x828*/     UINT8        PrcbPad4[56];                                                                
	/*0x860*/     struct _LIST_ENTRY DpcListHead;                      // 2 elements, 0x8 bytes (sizeof)    
	/*0x868*/     VOID*        DpcStack;                                                                    
	/*0x86C*/     ULONG32      DpcCount;                                                                    
	/*0x870*/     ULONG32      DpcQueueDepth;                                                               
	/*0x874*/     ULONG32      DpcRoutineActive;                                                            
	/*0x878*/     ULONG32      DpcInterruptRequested;                                                       
	/*0x87C*/     ULONG32      DpcLastCount;                                                                
	/*0x880*/     ULONG32      DpcRequestRate;                                                              
	/*0x884*/     ULONG32      MaximumDpcQueueDepth;                                                        
	/*0x888*/     ULONG32      MinimumDpcRate;                                                              
	/*0x88C*/     ULONG32      QuantumEnd;                                                                  
	/*0x890*/     UINT8        PrcbPad5[16];                                                                
	/*0x8A0*/     ULONG32      DpcLock;                                                                     
	/*0x8A4*/     UINT8        PrcbPad6[28];                                                                
	/*0x8C0*/     struct _KDPC CallDpc;                                // 9 elements, 0x20 bytes (sizeof)   
	/*0x8E0*/     VOID*        ChainedInterruptList;                                                        
	/*0x8E4*/     LONG32       LookasideIrpFloat;                                                           
	/*0x8E8*/     ULONG32      SpareFields0[6];                                                             
	/*0x900*/     UINT8        VendorString[13];                                                            
	/*0x90D*/     UINT8        InitialApicId;                                                               
	/*0x90E*/     UINT8        LogicalProcessorsPerPhysicalProcessor;                                       
	/*0x90F*/     UINT8        _PADDING0_[0x1];                                                             
	/*0x910*/     ULONG32      MHz;                                                                         
	/*0x914*/     ULONG32      FeatureBits;                                                                 
	/*0x918*/     union _LARGE_INTEGER UpdateSignature;                // 4 elements, 0x8 bytes (sizeof)    
	/*0x920*/     struct _FX_SAVE_AREA NpxSaveArea;                    // 3 elements, 0x210 bytes (sizeof)  
	/*0xB30*/     struct _PROCESSOR_POWER_STATE PowerState;            // 45 elements, 0x120 bytes (sizeof) 
          }KPRCB, *PKPRCB;   

//
// Define Address of Processor Control Registers.
//
#ifndef KIPCR
// #define KREGION_INDEX 7
// 
// #define KADDRESS_BASE ((ULONGLONG)(KREGION_INDEX) << 61)
// 
// #define KIPCR ((ULONG_PTR)(KADDRESS_BASE + 0xffff0000))            // kernel address of first PCR

//
// Define Pointer to Processor Control Registers.
//


//#define _PCR   fs:[0] 

//#define PCR ((volatile KPCR * const)KIPCR)	//不要这个
inline	struct _KPRCB * KeGetCurrentPrcb()
{
	KPCR *	pcr=NULL;
	__asm mov eax,fs:[0] 
	__asm mov pcr,eax
	return pcr->Prcb;
}
//#define KeGetCurrentPrcb() PCR->Prcb
#endif

typedef struct _LDT_ENTRY {
    USHORT  LimitLow;
    USHORT  BaseLow;
    union {
        struct {
            UCHAR   BaseMid;
            UCHAR   Flags1;     // Declare as bytes to avoid alignment
            UCHAR   Flags2;     // Problems.
            UCHAR   BaseHi;
        } Bytes;
        struct {
            ULONG   BaseMid : 8;
            ULONG   Type : 5;
            ULONG   Dpl : 2;
            ULONG   Pres : 1;
            ULONG   LimitHi : 4;
            ULONG   Sys : 1;
            ULONG   Reserved_0 : 1;
            ULONG   Default_Big : 1;
            ULONG   Granularity : 1;
            ULONG   BaseHi : 8;
        } Bits;
    } HighWord;
} LDT_ENTRY, *PLDT_ENTRY;

typedef struct _DESCRIPTOR_TABLE_ENTRY {
    ULONG Selector;
    LDT_ENTRY Descriptor;
} DESCRIPTOR_TABLE_ENTRY, *PDESCRIPTOR_TABLE_ENTRY;

// end_windbgkd
#define LDRP_STATIC_LINK                0x00000002
#define LDRP_IMAGE_DLL                  0x00000004
#define LDRP_LOAD_IN_PROGRESS           0x00001000
#define LDRP_UNLOAD_IN_PROGRESS         0x00002000
#define LDRP_ENTRY_PROCESSED            0x00004000
#define LDRP_ENTRY_INSERTED             0x00008000
#define LDRP_CURRENT_LOAD               0x00010000
#define LDRP_FAILED_BUILTIN_LOAD        0x00020000
#define LDRP_DONT_CALL_FOR_THREADS      0x00040000
#define LDRP_PROCESS_ATTACH_CALLED      0x00080000
#define LDRP_DEBUG_SYMBOLS_LOADED       0x00100000
#define LDRP_IMAGE_NOT_AT_BASE          0x00200000
#define LDRP_COR_IMAGE                  0x00400000
#define LDRP_COR_OWNS_UNMAP             0x00800000
#define LDRP_SYSTEM_MAPPED              0x01000000
#define LDRP_IMAGE_VERIFYING            0x02000000
#define LDRP_DRIVER_DEPENDENT_DLL       0x04000000
#define LDRP_ENTRY_NATIVE               0x08000000
#define LDRP_REDIRECTED                 0x10000000
#define LDRP_NON_PAGED_DEBUG_INFO       0x20000000
#define LDRP_MM_LOADED                  0x40000000
#define LDRP_COMPAT_DATABASE_PROCESSED  0x80000000

//
// Loader Data Table. Used to track DLLs loaded into an
// image.
//

typedef struct _LDR_DATA_TABLE_ENTRY {
    LIST_ENTRY InLoadOrderLinks;
    LIST_ENTRY InMemoryOrderLinks;
    LIST_ENTRY InInitializationOrderLinks;
    PVOID DllBase;
    PVOID EntryPoint;
    ULONG SizeOfImage;
    UNICODE_STRING FullDllName;
    UNICODE_STRING BaseDllName;
    ULONG Flags;
    USHORT LoadCount;
    USHORT TlsIndex;
    union {
        LIST_ENTRY HashLinks;
        struct {
            PVOID SectionPointer;
            ULONG CheckSum;
        };
    };
    union {
        struct {
            ULONG TimeDateStamp;
        };
        struct {
            PVOID LoadedImports;
        };
    };
    PVOID EntryPointActivationContext;
	
    PVOID PatchInformation;
	
} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;


                           
typedef struct _KTRAP_FRAME                               // 35 elements, 0x8C bytes (sizeof) 
          {                                                                                             
/*0x000*/     ULONG32      DbgEbp;                                                                      
/*0x004*/     ULONG32      DbgEip;                                                                      
/*0x008*/     ULONG32      DbgArgMark;                                                                  
/*0x00C*/     ULONG32      DbgArgPointer;                                                               
/*0x010*/     ULONG32      TempSegCs;                                                                   
/*0x014*/     ULONG32      TempEsp;                                                                     
/*0x018*/     ULONG32      Dr0;                                                                         
/*0x01C*/     ULONG32      Dr1;                                                                         
/*0x020*/     ULONG32      Dr2;                                                                         
/*0x024*/     ULONG32      Dr3;                                                                         
/*0x028*/     ULONG32      Dr6;                                                                         
/*0x02C*/     ULONG32      Dr7;                                                                         
/*0x030*/     ULONG32      SegGs;                                                                       
/*0x034*/     ULONG32      SegEs;                                                                       
/*0x038*/     ULONG32      SegDs;                                                                       
/*0x03C*/     ULONG32      Edx;                                                                         
/*0x040*/     ULONG32      Ecx;                                                                         
/*0x044*/     ULONG32      Eax;                                                                         
/*0x048*/     ULONG32      PreviousPreviousMode;                                                        
/*0x04C*/     struct _EXCEPTION_REGISTRATION_RECORD* ExceptionList;                                     
/*0x050*/     ULONG32      SegFs;                                                                       
/*0x054*/     ULONG32      Edi;                                                                         
/*0x058*/     ULONG32      Esi;                                                                         
/*0x05C*/     ULONG32      Ebx;                                                                         
/*0x060*/     ULONG32      Ebp;                                                                         
/*0x064*/     ULONG32      ErrCode;                                                                     
/*0x068*/     ULONG32      Eip;                                                                         
/*0x06C*/     ULONG32      SegCs;                                                                       
/*0x070*/     ULONG32      EFlags;                                                                      
/*0x074*/     ULONG32      HardwareEsp;                                                                 
/*0x078*/     ULONG32      HardwareSegSs;                                                               
/*0x07C*/     ULONG32      V86Es;                                                                       
/*0x080*/     ULONG32      V86Ds;                                                                       
/*0x084*/     ULONG32      V86Fs;                                                                       
/*0x088*/     ULONG32      V86Gs;                                                                       
          }KTRAP_FRAME, *PKTRAP_FRAME;               
		  
		  typedef KTRAP_FRAME *PKTRAP_FRAME;
typedef KTRAP_FRAME *PKEXCEPTION_FRAME;
typedef KTRAP_FRAME KEXCEPTION_FRAME;
		  
		  
#define KTRAP_FRAME_LENGTH  (sizeof(KTRAP_FRAME))
#define KTRAP_FRAME_ALIGN   (sizeof(ULONG))
#define KTRAP_FRAME_ROUND   (KTRAP_FRAME_ALIGN-1)
		  // Process Specific Access Rights
		  //
		  
#define PROCESS_TERMINATE         (0x0001)  // winnt
#define PROCESS_CREATE_THREAD     (0x0002)  // winnt
#define PROCESS_SET_SESSIONID     (0x0004)  // winnt
#define PROCESS_VM_OPERATION      (0x0008)  // winnt
#define PROCESS_VM_READ           (0x0010)  // winnt
#define PROCESS_VM_WRITE          (0x0020)  // winnt
		  // begin_ntddk begin_wdm begin_ntifs
#define PROCESS_DUP_HANDLE        (0x0040)  // winnt
		  // end_ntddk end_wdm end_ntifs
